#На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
#Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
#Выведите минимальное количество монет, которые нужно перевернуть

n = int(input("Введите количество монеток:"))
print("Введите 0, если монета лежит вверх решкой. \nВведите 1, если монета лежит вверж гербом.")
countTails = 0
countArms = 0
for i in range(n):
    coin = int(input("Как лежит монета?\n"))
    if coin == 0:
        countTails += 1
    elif coin == 1:
        countArms += 1
    else:
        print("Введены неверные данные. Введите 0 или 1.")
print(f"Необходимо перевернуть {min(countTails, countArms)} монет.")


