#Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, 
#если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
#*Пример:*
#3 2 4 -> yes
#3 2 1 -> no
sizeN = int(input("Введите количество долек по длине:"))
sizeM = int(input("Введте количество долек по ширине:"))
count = int(input("Введите необходимое количество долек:"))
if count < sizeN*sizeM and (count%sizeN == 0 or count%sizeM == 0):
    print("Yes")
else:
    print("No")