# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
#Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
#Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

#*Пример:*

#385916 -> yes
#123456 -> no
number = int(input("Введите шестизначный номер билета:"))
if number<=999999 and number>100000:
    numberFerst = number // 1000
    numberSecond = number % 1000
    sumFerst = numberFerst//100 + numberFerst%10 + numberFerst//10%10
    sumSecond = numberSecond//100 + numberSecond%10 + numberSecond//10%10
    if sumFerst == sumSecond:
        print('yes')
    else:
        print('no')
else:
    print("Вы ввели НЕ шестизначное число")
