#Найдите сумму цифр трехзначного числа.
#*Пример:*
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0)
number = int(input("Введите трёхзначное число:"))
if number>999 or number<100:
    print("Вы ввели НЕ трёхзначное число")   
else:
    sum = number//100 + number%10 + number//10%10
    print(f"Сумма цифр в числе {number} равна: {sum}")
